Repository: Leafuke/FolderRewind
Catalog: FolderRewind/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# SettingsPage_AppUpdateSourceDesc.Text
source: Preferred source for app updates, the plugin store, the online template list, and template downloads (Store app updates are unaffected)
zh_cn: 用于应用更新、插件商店、在线模板列表和模板文件下载的首选来源（商店版应用更新不受此项影响）

# SettingsPage_AppUpdateSource_Official.Content
source: Official GitHub
zh_cn: 官方 GitHub

# SettingsPage_AppUpdateSource_Mirror1.Content
source: Mirror 1
zh_cn: 镜像源 1

# SettingsPage_AppUpdateSource_Mirror2.Content
source: Mirror 2
zh_cn: 镜像源 2

# SettingsPage_AppUpdateSource_Custom.Content
source: Custom mirror
zh_cn: 自定义镜像

# SettingsPage_AppUpdateAutoFallback.Text
source: Auto switch on failure
zh_cn: 下载失败时自动切换源

# SettingsPage_AppUpdateAutoFallbackDesc.Text
source: Automatically retry other mirror sources when the preferred source fails
zh_cn: 首选源失败后自动按顺序重试其他镜像来源

# SettingsPage_AppUpdateCustomMirror.Text
source: Custom mirror URL
zh_cn: 自定义镜像地址

# SettingsPage_AppUpdateCustomMirrorDesc.Text
source: Enter a prefix URL or a template containing {url} for GitHub/API downloads
zh_cn: 可填写前缀，或使用 {url} 占位符拼接完整 GitHub/API 下载地址

# SettingsPage_AppUpdateCustomMirrorInput.PlaceholderText
source: Example: https://example.com/{url}
zh_cn: 例如：https://example.com/{url}

# HistoryPage_ScanRecover.ToolTipService.ToolTip
source: Scan a folder for backup archives and rebuild missing history records
zh_cn: 扫描备份文件夹并重建丢失的历史记录

# HistoryPage_ScanRecoverText.Text
source: Recover History
zh_cn: 重建历史

# History_ScanRecover_SelectFirst
source: Please select a backup project and folder first
zh_cn: 请先选择一个备份项目和文件夹

# History_ScanRecover_ResultSuccess
source: Successfully recovered {0} history record(s)
zh_cn: 成功恢复了 {0} 条历史记录

# History_ScanRecover_ResultNone
source: No matching backup files found in the selected folder
zh_cn: 在选择的文件夹中未找到匹配的备份文件

# History_ScanRecover_Success
source: Scan recovered {0} history record(s) for folder "{1}"
zh_cn: 扫描恢复了文件夹 "{1}" 的 {0} 条历史记录

# History_ScanRecover_NoMatch
source: No matching backup files found for folder "{0}"
zh_cn: 未找到文件夹 "{0}" 的匹配备份文件

# History_ScanRecover_Error
source: Error scanning backup files: {0}
zh_cn: 扫描备份文件时出错：{0}

# SettingsPage_About_Link_Document.Content
source: Documentation
zh_cn: 阅读文档

# ConfigSettingsDialog_SaveAsTemplateText.Text
source: Save as template
zh_cn: 保存为模板

# ConfigSettingsDialog_SaveAsTemplateDesc.Text
source: Save this backup project as a reusable template (strategy, filters, and path rules).
zh_cn: 将当前备份项目保存为可复用模板（含策略、过滤器与路径规则）。

# HomePage_AddFromTemplate.Text
source: Create from template
zh_cn: 从模板创建

# SettingsPage_TemplateData.Text
source: Template data
zh_cn: 模板数据

# SettingsPage_TemplateDataDesc.Text
source: Export or import templates for cross-device sharing and quick reuse.
zh_cn: 导出或导入模板配置，用于跨设备共享和快速复用。

# SettingsPage_ExportTemplate.Content
source: Export template
zh_cn: 导出模板

# SettingsPage_ImportTemplate.Content
source: Import template
zh_cn: 导入模板

# Settings_Template_Export_NoTemplates
source: No templates are available to export.
zh_cn: 当前没有可导出的模板。

# Settings_Template_SelectToExport
source: Select a template to export
zh_cn: 选择要导出的模板

# Template_DefaultName
source: New template
zh_cn: 新模板

# BackupPreset_StandardGame_Name
source: Standard Game Backup
zh_cn: 标准游戏备份方案

# BackupPreset_StandardGame_Description
source: Uses FolderRewind's current safe defaults without enabling schedules or cloud sync.
zh_cn: 使用 FolderRewind 当前的安全默认设置，不自动启用计划任务或云同步。

# Template_SaveDialog_Title
source: Save as template
zh_cn: 保存为模板

# Template_SaveDialog_Hint
source: Save the current strategy and path rules as a template for reuse or sharing.
zh_cn: 将当前配置的策略与路径规则保存为模板，便于复用或分享。

# Template_SaveDialog_Name
source: Template name
zh_cn: 模板名称

# Template_SaveDialog_Author
source: Author (optional)
zh_cn: 作者（可选）

# Template_SaveDialog_AuthorPlaceholder
source: e.g. your nickname
zh_cn: 例如：你的昵称

# Template_SaveDialog_Description
source: Description (optional)
zh_cn: 说明（可选）

# Template_Create_SourceConfigNull
source: Current configuration is null and cannot be saved as a template.
zh_cn: 当前配置为空，无法创建模板。

# Template_Create_NameRequired
source: Template name is required.
zh_cn: 模板名称不能为空。

# Template_Create_ConfigUnavailable
source: Current configuration is unavailable. Failed to save template.
zh_cn: 当前配置不可用，无法保存模板。

# Template_Create_NoPathRules
source: Template saved, but no auto-discovery path rule could be inferred.
zh_cn: 模板已保存，但未推断到可自动扫描的路径规则。

# Template_Create_Success
source: Template created: {0}
zh_cn: 已创建模板：{0}

# Template_Create_OverwriteSuccess
source: Existing template overwritten: {0}
zh_cn: 已覆盖同名模板：{0}

# Template_Apply_TemplateNull
source: Template is null and cannot be applied.
zh_cn: 模板为空，无法创建配置。

# Template_Apply_NameRequired
source: Configuration name is required.
zh_cn: 配置名称不能为空。

# Template_AutoDiscoveredFolderDescription
source: Auto-discovered from template
zh_cn: 由模板自动识别

# Template_Apply_SuccessWithFolders
source: Configuration created and {0} source folder(s) were auto-discovered.
zh_cn: 已根据模板自动加入 {0} 个来源文件夹。

# Template_Apply_SuccessNoFolders
source: Configuration created, but no source folder was auto-discovered. Please add folders manually.
zh_cn: 配置已创建，但暂未自动识别到来源文件夹，请手动添加。

# Template_ConfigKindUnavailable
source: Template kind "{0}" is unavailable because its owner plugin is missing. Falling back to the Core default.
zh_cn: 模板种类“{0}”的所有者插件不可用，已回退为 Core 默认种类。

# Template_Export_TemplateNotFound
source: Template not found.
zh_cn: 未找到要导出的模板。

# Template_Export_PathEmpty
source: Export path is empty.
zh_cn: 导出路径为空。

# Template_Export_Success
source: Template exported to: {0}
zh_cn: 模板已导出到：{0}

# Template_Export_Failed
source: Failed to export template: {0}
zh_cn: 模板导出失败：{0}

# Template_Import_FileNotFound
source: Template file not found.
zh_cn: 未找到模板文件。

# Template_Import_ConfigUnavailable
source: Current configuration is unavailable. Failed to import template.
zh_cn: 当前配置不可用，无法导入模板。

# Template_Import_InvalidFile
source: Invalid or unsupported template file.
zh_cn: 模板文件无效或格式不受支持。

# Template_Import_SchemaUnsupported
source: This template file is from a newer version and cannot be imported yet.
zh_cn: 模板文件版本过新，当前程序暂不支持导入。

# Template_Import_Overwrite
source: Template overwritten: {0}
zh_cn: 已覆盖同名模板：{0}

# Template_Import_Success
source: Template imported: {0}
zh_cn: 已导入模板：{0}

# Template_Import_KeepBothRenamed
source: Template imported and renamed to "{1}" (original name: {0}).
zh_cn: 已导入模板，并重命名为“{1}”（原名：{0}）。

# Template_Import_ConflictTitle
source: Template conflict
zh_cn: 模板冲突

# Template_Import_ConflictContent
source: The imported template "{0}" conflicts with the existing template "{1}". Do you want to replace the existing one or keep both?
zh_cn: 导入的模板“{0}”与现有模板“{1}”发生冲突。你想覆盖现有模板，还是保留两份？

# Template_Import_ConflictReplace
source: Replace existing
zh_cn: 覆盖现有模板

# Template_Import_ConflictKeepBoth
source: Keep both
zh_cn: 保留两份

# Template_Import_Failed
source: Failed to import template: {0}
zh_cn: 模板导入失败：{0}

# Template_CreateFrom_Home_Title
source: Create configuration from template
zh_cn: 从模板创建配置

# Template_CreateFrom_Home_NoTemplates
source: No local templates yet. Search the official repository, import one, and then continue creating the configuration.
zh_cn: 当前还没有本地模板。你可以先搜索官方模板并导入，再继续创建配置。

# Template_CreateFrom_Home_Template
source: Select template
zh_cn: 选择模板

# Template_CreateFrom_Home_LocalTemplatesHint
source: Select a local template directly, or search the official repository, import one, and then continue.
zh_cn: 可直接选择本地模板，或先搜索官方模板并导入后再创建。

# Template_CreateFrom_Home_OfficialSearchHeader
source: Search official templates
zh_cn: 搜索官方模板

# Template_CreateFrom_Home_OfficialSearchPlaceholder
source: Search the official repository by template name, game, author, or share code
zh_cn: 输入模板名、游戏名、作者或分享码后搜索官方仓库

# Template_CreateFrom_Home_SearchOfficial
source: Search official templates
zh_cn: 搜索官方模板

# Template_CreateFrom_Home_TemplateInfo
source: Template "{0}" with {1} path rule(s).
zh_cn: 模板“{0}”，包含 {1} 条路径规则。

# Template_CreateFrom_Home_SelectFoldersTitle
source: Confirm discovered source folders
zh_cn: 确认识别到的来源文件夹

# Template_CreateFrom_Home_SelectFoldersDesc
source: Template "{0}" discovered {1} candidate source folder(s). Please confirm which ones should be added to the new configuration.
zh_cn: 模板“{0}”识别到了 {1} 个候选来源文件夹。请确认哪些需要加入新配置。

# Template_CreateFrom_Home_SelectFoldersHint
source: No candidates are selected by default. Please verify the suggested paths before continuing.
zh_cn: 当前没有默认勾选项，建议你先确认候选路径是否正确，再继续创建。

# Template_CreateFrom_Home_FolderCandidateMeta
source: Rule: {0} | Confidence: {1} | {2}
zh_cn: 规则：{0} | 置信度：{1} | {2}

# Template_CreateFrom_Home_FolderCandidateAuto
source: Selected by default
zh_cn: 默认勾选

# Template_CreateFrom_Home_FolderCandidateSuggested
source: Needs manual review
zh_cn: 需手动确认

# Template_CreateFrom_Home_SelectionSummary
source: Configuration created with {0} / {1} candidate source folder(s) selected.
zh_cn: 配置已创建，共选择 {0} / {1} 个候选来源文件夹。

# Template_RequiredPluginsMissing
source: Required plugins for this template are missing: {0}
zh_cn: 模板依赖的插件未安装：{0}

# SettingsPage_ManageTemplates.Content
source: Manage templates
zh_cn: 管理模板

# TemplateManagerDialog.Title
source: Template manager
zh_cn: 模板管理

# TemplateManagerDialog.CloseButtonText
source: Close
zh_cn: 关闭

# TemplateManagerDialog_ListHeader.Text
source: Templates
zh_cn: 模板列表

# TemplateManagerDialog_Search.PlaceholderText
source: Search by name, author, or type
zh_cn: 按名称、作者或类型搜索

# TemplateManagerDialog_DetailHeader.Text
source: Template details
zh_cn: 模板详情

# TemplateManagerDialog_Name.Header
source: Name
zh_cn: 模板名称

# TemplateManagerDialog_Author.Header
source: Author
zh_cn: 作者

# TemplateManagerDialog_Description.Header
source: Description
zh_cn: 说明

# TemplateManagerDialog_TemplateMeta.Text
source: Select a template from the left to view details.
zh_cn: 请选择左侧模板以查看详情。

# TemplateManagerDialog_TemplateMetaFormat
source: Type: {0} | Updated: {1} | Rules: {2}
zh_cn: 类型：{0} | 更新时间：{1} | 规则数：{2}

# TemplateManagerDialog_Save.Content
source: Save changes
zh_cn: 保存修改

# TemplateManagerDialog_Duplicate.Content
source: Duplicate
zh_cn: 复制模板

# TemplateManagerDialog_Delete.Content
source: Delete
zh_cn: 删除模板

# TemplateManagerDialog_Export.Content
source: Export
zh_cn: 导出模板

# TemplateManagerDialog_DeleteConfirmYes.Content
source: Delete
zh_cn: 确认删除

# TemplateManagerDialog_DeleteConfirmNo.Content
source: Cancel
zh_cn: 取消

# TemplateManagerDialog_PreviewHeader.Text
source: Rule preview
zh_cn: 规则预览

# TemplateManagerDialog_RefreshPreview.Content
source: Refresh preview
zh_cn: 刷新预览

# TemplateManagerDialog_PathRulesHeader.Text
source: Path matching rules
zh_cn: 路径匹配规则

# TemplateManagerDialog_PathRulesGuideHeader.Text
source: Supported variables and syntax
zh_cn: 支持的变量与语法

# TemplateManagerDialog_PathRulesHint.Text
source: Edit path expressions directly, for example {AppDataRoaming}\.minecraft\versions\{*}\saves\{*}, {SteamUserData}\{UserIdCandidate}\123456\remote, or {Process:xxx.exe}\.minecraft\versions\{*}\saves\{*}. {*} can appear in the middle or at the end of a path and expands every child folder at that level before continuing. {Process:xxx.exe} resolves the install directory of a currently running process, then continues matching from there.
zh_cn: 支持直接编辑路径表达式，例如 {AppDataRoaming}\.minecraft\versions\{*}\saves\{*}、{SteamUserData}\{UserIdCandidate}\123456\remote，或 {Process:Plain Craft Launcher 2.exe}\.minecraft\versions\{*}\saves\{*}。{*} 可写在路径中间或末尾，表示展开这一层下的全部子文件夹后继续匹配；{Process:xxx.exe} 会先定位当前运行中进程的程序目录，再继续向下拼接。

# TemplateManagerDialog_AddRule.Content
source: Add rule
zh_cn: 添加规则

# TemplateManagerDialog_SaveRules.Content
source: Save rules
zh_cn: 保存规则

# TemplateManagerDialog_PathRuleName.Text
source: Rule name
zh_cn: 规则名称

# TemplateManagerDialog_PathRulePath.Text
source: Path expression
zh_cn: 路径表达式

# TemplateManagerDialog_PathRuleFileMatch.Text
source: Marker (file match list)
zh_cn: 标记（文件匹配列表）

# TemplateManagerDialog_PathRuleFileMatchDesc.Text
source: Separate file names with ;. A rule matches only when the path matches and every listed file exists.
zh_cn: 多个文件名用 ; 分隔。只有路径命中且这些文件全部存在时，这条规则才算匹配成功。

# TemplateManagerDialog_PathRuleFileMatchInput.PlaceholderText
source: For example: level.dat;session.lock
zh_cn: 例如：level.dat;session.lock

# TemplateManagerDialog_PathRuleAuto.Content
source: Selected by default
zh_cn: 默认勾选

# TemplateManagerDialog_PathRuleConfidence.Text
source: Confidence (0-1)
zh_cn: 置信度（0-1）

# TemplateManagerDialog_RemoveRule.Content
source: Remove rule
zh_cn: 删除规则

# TemplateManagerDialog_NoRules.Text
source: This template has no path rules yet. You can add one manually.
zh_cn: 当前模板还没有路径规则，可手动添加。

# TemplateManagerDialog_PreviewSummary.Text
source: Select a template to view rule match results.
zh_cn: 选择模板后可查看规则命中结果。

# TemplateManagerDialog_NoPreview.Text
source: No preview data.
zh_cn: 暂无预览结果。

# TemplateManagerDialog_EmptyList.Text
source: No templates matched.
zh_cn: 没有匹配的模板。

# Template_Manager_SelectFirst
source: Please select a template first.
zh_cn: 请先选择一个模板。

# Template_Manager_DeleteConfirm
source: Delete template "{0}"? This action cannot be undone.
zh_cn: 确定删除模板“{0}”吗？此操作不可撤销。

# Template_Manager_PathRuleInvalid
source: Invalid path expression: {0}
zh_cn: 路径表达式无效：{0}

# Template_Manager_PathRuleFileMatchInvalid
source: Invalid file match entry: {0}
zh_cn: 文件匹配项无效：{0}

# Template_Manager_PathRulesUpdated
source: Template path rules updated.
zh_cn: 模板路径规则已更新。

# Template_PathRule_CollectionName
source: {0} (collection match)
zh_cn: {0}（集合匹配）

# Template_Update_NameRequired
source: Template name is required.
zh_cn: 模板名称不能为空。

# Template_Update_TemplateNotFound
source: Template to update was not found.
zh_cn: 未找到要更新的模板。

# Template_Update_NameConflict
source: Template name "{0}" already exists. Please choose another name.
zh_cn: 模板名“{0}”已存在，请使用其他名称。

# Template_Update_Success
source: Template "{0}" was updated.
zh_cn: 模板“{0}”已更新。

# Template_Duplicate_TemplateNotFound
source: Template to duplicate was not found.
zh_cn: 未找到要复制的模板。

# Template_Duplicate_Success
source: Template copy created: {0}
zh_cn: 已创建模板副本：{0}

# Template_Duplicate_CopySuffix
source: Copy
zh_cn: 副本

# Template_Delete_TemplateNotFound
source: Template to delete was not found.
zh_cn: 未找到要删除的模板。

# Template_Delete_Failed
source: Failed to delete template.
zh_cn: 删除模板失败。

# Template_Delete_Success
source: Template deleted: {0}
zh_cn: 已删除模板：{0}

# Template_Preview_TemplateNotFound
source: Template for preview was not found.
zh_cn: 未找到要预览的模板。

# Template_Preview_NoRules
source: This template has no path rules to preview.
zh_cn: 该模板没有可预览的路径规则。

# Template_Preview_UnnamedRule
source: Unnamed rule
zh_cn: 未命名规则

# Template_Preview_NoPath
source: N/A
zh_cn: 无

# Template_Preview_StatusMatched
source: Matched
zh_cn: 已命中

# Template_Preview_StatusNoMatch
source: No match
zh_cn: 未命中

# Template_Preview_MatchCount
source: Matched paths: {0}
zh_cn: 命中路径数：{0}

# Template_Preview_MarkerNone
source: Markers: none
zh_cn: 标记：无

# Template_Preview_MarkerSummary
source: Markers: required {0}, optional {1}
zh_cn: 标记：必需 {0}，可选 {1}

# Template_SyntaxHelp_Variables_Title
source: Common variables
zh_cn: 常用变量

# Template_SyntaxHelp_Variables_Description
source: You can use these variables as path roots: {UserProfile}, {Documents}, {DocumentsMyGames}, {SavedGames}, {AppDataRoaming}, {AppDataLocal}, {AppDataLocalLow}, {ProgramData}, {SteamUserData}, and {UserName}.
zh_cn: 可直接使用这些变量作为路径起点：{UserProfile}、{Documents}、{DocumentsMyGames}、{SavedGames}、{AppDataRoaming}、{AppDataLocal}、{AppDataLocalLow}、{ProgramData}、{SteamUserData}、{UserName}。

# Template_SyntaxHelp_Variables_Example
source: Example: {AppDataRoaming}\GameName\Saves
zh_cn: 示例：{AppDataRoaming}\GameName\Saves

# Template_SyntaxHelp_Wildcard_Title
source: {*} wildcard folders
zh_cn: {*} 通配目录

# Template_SyntaxHelp_Wildcard_Description
source: {*} expands every child folder at the current level. You can place it in the middle of a path or chain it multiple times. When it is the first segment, it traverses every ready drive.
zh_cn: {*} 展开当前层级下的所有子文件夹，可写在路径中间或连续使用。放在最前面时，会遍历所有可用盘符。

# Template_SyntaxHelp_Wildcard_Example
source: Example: {*}\{*}\.minecraft\versions\{*}\saves\{*}
zh_cn: 示例：{*}\{*}\.minecraft\versions\{*}\saves\{*}

# Template_SyntaxHelp_Process_Title
source: Process directory
zh_cn: 进程目录

# Template_SyntaxHelp_Process_Description
source: {Process:xxx.exe} resolves the install directory of a currently running process before continuing the match. It works well for launchers and portable games.
zh_cn: {Process:xxx.exe} 会先定位当前正在运行进程的程序目录，再继续向下匹配，适合启动器或便携版游戏。

# Template_SyntaxHelp_Process_Example
source: Example: {Process:Plain Craft Launcher 2.exe}\.minecraft\versions\{*}\saves\{*}
zh_cn: 示例：{Process:Plain Craft Launcher 2.exe}\.minecraft\versions\{*}\saves\{*}

# Template_SyntaxHelp_Root_Title
source: Explicit drive roots
zh_cn: 显式盘符路径

# Template_SyntaxHelp_Root_Description
source: You can now start expressions directly from a drive root such as C:\..., and you can mix explicit drives with wildcard folders.
zh_cn: 现在可以直接从盘符根目录开始写表达式，例如 C:\...；也可以把盘符和通配目录混用。

# Template_SyntaxHelp_Root_Example
source: Example: C:\{*}\.minecraft\versions\{*}\saves\{*}
zh_cn: 示例：C:\{*}\.minecraft\versions\{*}\saves\{*}

# Template_SyntaxHelp_FileMatch_Title
source: File match list
zh_cn: 文件匹配列表

# Template_SyntaxHelp_FileMatch_Description
source: When you provide a ; separated list of file names, the rule only matches if the directory matches and every listed file exists.
zh_cn: 为规则填写一个用 ; 分隔的文件名列表后，只有当目录命中且列表中的所有文件都存在时，这条规则才会被视为命中。

# Template_SyntaxHelp_FileMatch_Example
source: Example: level.dat;session.lock
zh_cn: 示例：level.dat;session.lock

# Template_Preview_Summary
source: {0} of {1} rule(s) matched.
zh_cn: 共 {1} 条规则，命中 {0} 条。

# SettingsPage_BrowseOfficialTemplates.Content
source: Import official template
zh_cn: 导入官方模板

# SettingsPage_UseTemplateShareCode.Content
source: Import by share code
zh_cn: 分享码导入模板

# SettingsPage_PrepareTemplateSubmission.Content
source: Prepare submission
zh_cn: 准备投稿文件

# OfficialTemplates_SourceCache
source: Local cache
zh_cn: 本地缓存

# OfficialTemplates_UsingCachedIndex
source: Using the locally cached template index.
zh_cn: 已回退到本地缓存索引。

# OfficialTemplates_IndexEmpty
source: No templates are currently available in the official library.
zh_cn: 官方模板库当前暂无可用模板。

# OfficialTemplates_FetchIndexFailed
source: Failed to fetch the official template index. Please try again later.
zh_cn: 无法获取官方模板索引，请稍后重试。

# OfficialTemplates_FetchIndexFailedLog
source: Failed to fetch official template index: {0} - {1}
zh_cn: 获取官方模板索引失败：{0} - {1}

# OfficialTemplates_TemplateNotFound
source: The requested official template was not found.
zh_cn: 未找到对应的官方模板。

# OfficialTemplates_TemplateDisabled
source: This template has been disabled and cannot be used right now.
zh_cn: 该模板已被停用，暂时无法使用。

# OfficialTemplates_TemplateUrlMissing
source: The template download URL is missing.
zh_cn: 模板下载地址缺失。

# OfficialTemplates_HashMismatch
source: The template file failed integrity verification.
zh_cn: 模板文件校验失败，已拒绝导入。

# OfficialTemplates_LoadFailed
source: Failed to parse the downloaded template file.
zh_cn: 模板文件解析失败。

# OfficialTemplates_DownloadSuccess
source: Downloaded official template: {0}
zh_cn: 已下载官方模板：{0}

# OfficialTemplates_DownloadFailed
source: Failed to download official template: {0}
zh_cn: 下载官方模板失败：{0}

# OfficialTemplates_BrowseTitle
source: Official template library
zh_cn: 官方模板库

# OfficialTemplates_CreateFromOfficialTitle
source: Create config from official template
zh_cn: 从官方模板创建配置

# OfficialTemplates_SearchHeader
source: Search templates
zh_cn: 搜索模板

# OfficialTemplates_SearchPlaceholder
source: Search by game, template, Steam AppID, or share code
zh_cn: 输入游戏名、模板名、Steam AppID 或分享码

# OfficialTemplates_TemplateHeader
source: Templates
zh_cn: 模板列表

# OfficialTemplates_SourceLabel
source: Index source: {0}
zh_cn: 索引来源：{0}

# OfficialTemplates_SourceLabelWithHint
source: Index source: {0} ({1})
zh_cn: 索引来源：{0}（{1}）

# OfficialTemplates_NoSearchResults
source: No matching templates.
zh_cn: 没有匹配的模板。

# OfficialTemplates_ShareCodeHeader
source: Share code
zh_cn: 分享码

# OfficialTemplates_ShareCodePlaceholder
source: Enter the 5-character share code
zh_cn: 输入 5 位分享码

# OfficialTemplates_UseByShareCodeTitle
source: Use template by share code
zh_cn: 通过分享码使用模板

# OfficialTemplates_InvalidShareCode
source: Invalid share code format. Please enter 5 uppercase letters or digits.
zh_cn: 分享码格式无效，请输入 5 位大写字母/数字组合。

# OfficialTemplates_ShareCodeNotFound
source: No template matched that share code.
zh_cn: 未找到对应的分享码。

# OfficialTemplates_DetailName
source: Template: {0}
zh_cn: 模板：{0}

# OfficialTemplates_DetailGame
source: Game: {0}
zh_cn: 游戏：{0}

# OfficialTemplates_DetailShareCode
source: Share code: {0}
zh_cn: 分享码：{0}

# OfficialTemplates_DetailAuthor
source: Author: {0}
zh_cn: 作者：{0}

# OfficialTemplates_DetailVersion
source: Version: {0}
zh_cn: 版本：{0}

# Template_Submission_TemplateNull
source: Template not found.
zh_cn: 模板不存在。

# Template_Submission_NameRequired
source: A submission template must have a name.
zh_cn: 投稿模板必须填写名称。

# Template_Submission_DescriptionRequired
source: A submission template must include a description.
zh_cn: 投稿模板必须填写描述。

# Template_Submission_PathRulesRequired
source: A submission template must include at least one valid path rule.
zh_cn: 投稿模板至少需要一条有效路径规则。

# Template_Submission_DryRunFailed
source: The template failed a basic dry run and cannot be used to create a config.
zh_cn: 模板基础校验失败，无法正常用于创建配置。

# Template_Submission_GameNameRecommended
source: Adding a game name is recommended for discoverability.
zh_cn: 建议填写游戏名称，方便官方模板库检索。

# Template_Submission_ValidationFailed
source: Template validation failed with {0} issue(s).
zh_cn: 模板校验未通过，共发现 {0} 个问题。

# Template_Submission_ValidationWarning
source: Template validation passed with {0} recommendation(s).
zh_cn: 模板校验通过，但有 {0} 条建议可进一步完善。

# Template_Submission_ValidationPassed
source: Template validation passed. You can export the submission package now.
zh_cn: 模板校验通过，可以导出投稿文件。

# Template_Submission_SummaryName
source: Template name: {0}
zh_cn: 模板名称：{0}

# Template_Submission_SummaryGame
source: Game name: {0}
zh_cn: 游戏名称：{0}

# Template_Submission_SummaryAuthor
source: Author: {0}
zh_cn: 作者：{0}

# Template_Submission_SummaryConfigKind
source: Configuration kind: {0}
zh_cn: 配置种类：{0}

# Template_Submission_SummaryVersion
source: Template version: {0}
zh_cn: 模板版本：{0}

# Template_Submission_SummaryRuleCount
source: Path rules: {0}
zh_cn: 路径规则数：{0}

# Template_Submission_SummaryPlugins
source: Required plugins: {0}
zh_cn: 依赖插件：{0}

# Template_Submission_SummaryDescription
source: Description:
zh_cn: 模板描述：

# Template_Submission_AuthorAnonymous
source: Anonymous
zh_cn: 匿名

# Template_Submission_SelectTemplate.Text
source: Select a local template to submit
zh_cn: 选择要投稿的本地模板

# Template_Submission_GameNameHeader.Text
source: Game name (optional)
zh_cn: 游戏名称（可选）

# Template_Submission_PrepareHint.Text
source: You can export a standard submission package first or submit directly through GitHub. Exporting also copies the submission summary to your clipboard.
zh_cn: 你可以先导出标准投稿包，也可以直接走 GitHub 自动提交流程。导出时会自动复制投稿摘要，方便粘贴到表单中。

# Template_Submission_SummaryTitle
source: Submission summary
zh_cn: 投稿摘要

# TemplateSubmissionDialog.Title
source: Submit template
zh_cn: 投稿模板

# TemplateSubmissionDialog_ExportPackage
source: Export submission package
zh_cn: 导出投稿文件

# TemplateSubmissionDialog_SubmitToGitHub
source: Submit template automatically
zh_cn: 自动提交模板

# TemplateSubmissionDialog_PrepareSection.Text
source: Prepare submission package
zh_cn: 准备投稿文件

# TemplateSubmissionDialog_GitHubSection.Text
source: GitHub automated submission
zh_cn: GitHub 自动提交
